tutorials/compressible/nexaFoam/obliqueShock_multicompMix/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TTRValue  1000;
TVibValue 1000;

pressureValue  1;

velocityValue  (2.9 0 0);

N2_mol_fraction 0.45;
O2_mol_fraction 0.55;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
